###################################################################

# Created by write_sdc on Sun Feb 14 20:47:16 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[31]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[30]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[29]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[28]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[27]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[26]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[25]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[24]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[23]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[22]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[21]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[20]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[19]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[18]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[17]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[16]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[15]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[14]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[13]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[12]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[11]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[10]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[9]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[8]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[7]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[6]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[5]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[4]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[3]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[2]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[1]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_addr[0]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[31]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[30]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[29]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[28]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[27]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[26]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[25]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[24]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[23]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[22]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[21]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[20]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[19]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[18]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[17]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[16]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[15]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[14]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[13]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[12]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[11]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[10]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[9]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[8]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[7]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[6]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[5]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[4]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[3]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[2]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[1]}]
set_load -pin_load 3.40189 [get_ports {phy_instr_mem_addr[0]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[31]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[30]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[29]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[28]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[27]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[26]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[25]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[24]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[23]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[22]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[21]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[20]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[19]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[18]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[17]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[16]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[15]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[14]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[13]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[12]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[11]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[10]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[9]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[8]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[7]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[6]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[5]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[4]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[3]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[2]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[1]}]
set_load -pin_load 3.40189 [get_ports {phy_data_mem_in[0]}]
set_load -pin_load 3.40189 [get_ports phy_data_mem_wr_en]
create_clock [get_ports clk]  -period 0  -waveform {0 0}
set_clock_uncertainty 0.07  [get_clocks clk]
set_input_delay -clock clk  -max 0.5  [get_ports rst_n]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[31]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[30]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[29]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[28]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[27]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[26]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[25]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[24]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[23]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[22]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[21]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[20]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[19]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[18]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[17]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[16]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_out[0]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[31]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[30]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[29]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[28]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[27]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[26]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[25]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[24]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[23]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[22]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[21]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[20]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[19]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[18]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[17]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[16]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_out[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_addr[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_instr_mem_addr[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {phy_data_mem_in[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports phy_data_mem_wr_en]
